#1. Реализовать вывод информации о промежутке времени
# в зависимости от его продолжительности duration в секундах:

#до минуты: <s> сек;
#* до часа: <m> мин <s> сек;
# до суток: <h> час <m> мин <s> сек;
# *до месяца, до года, больше года: по аналогии.

# m = 60 sec
# h = 60 * 60 = 3600
# d = 3600 * 24 = 86400
# mnth = 86400 * 30 = 2592000
# year = 2592000 * 12 = 31104000


a = int(input("Введите колличество времени в секундах: "))

if a <= 60:
    print("Длительность в секундах: " + str(a) + " сек.")

if a > 60 and a <= 3600:
    m = a // 60
    s = a % 60
    print("Длительность в минутах: " + str(m) + " мин. " + str(s) + " сек.")

if a > 3600 and a <= 86400:
    h = a // 3600
    m = (a % 3600) // 60
    s = (a % 3600) % 60
    print("Длительность в часах: " + str(h) + " ч. "+ str(m) + " мин. " + str(s) + " сек.")

if a > 86400 and a <= 2592000:
    d = a // 86400
    h = (a % 86400) // 3600
    m = ((a % 86400) % 3600) // 60
    s = ((a % 86400) % 3600) % 60
    print("Длительность в днях: " + str(d) + " дн. " + str(h) + " ч. "+ str(m) + " мин. " + str(s) + " сек.")


if a > 2592000 and a <= 31104000:
    mnth = a // 2592000
    d = (a % 2592000) // 86400
    h = ((a % 2592000) % 86400) // 3600
    m = (((a % 2592000) % 86400) % 3600) // 60
    s = (((a % 2592000) % 86400) % 3600) % 60
    print("Длительность в месяцах: " + str(mnth) + " мес. " + str(d) + " дн. " + str(h) + " ч. "+ str(m) + " мин. " + str(s) + " сек.")

if a > 31104000:
    yr = a // 31104000
    mnth = (a % 31104000) // 2592000
    d = ((a % 31104000) % 2592000) // 86400
    h = (((a % 31104000) % 2592000) % 86400) // 3600
    m = ((((a % 31104000) % 2592000) % 86400) % 3600) // 60
    s = ((((a % 31104000) % 2592000) % 86400) % 3600) % 60
    print("Длительность в годах: " + str(yr) + " г. " + str(mnth) + " мес. " + str(d) + " дн. " + str(h) + " ч. "+ str(m) + " мин. " + str(s) + " сек.")


